Revit 2027 API
ExportFailures Properties
The BuiltInFailures.ExportFailures type exposes the following members.
Properties
Name | Description
CannotAddPropertyToReservedPropertySet |  Cannot add properties to reserved property sets. Please see journal for details.
IFCFatalExportError |  There has been an unrecoverable error during export. Export will now be aborted.
IFCFatalToolkitExportError |  There has been an unrecoverable error during export. Export will now be aborted.
IFCGenericExportWarning |  Unexpected errors occurred while exporting these elements to the IFC file.
SwitchToRasterProcessingInsteadOfVectorWarning |  Some of the views have been switched to raster processing though vector processing is selected.
UserDefinedPropertySetReserved |  User-defined property sets cannot start with reserved string "Pset_". Please see journal for details.
Top
See Also
Reference
BuiltInFailures.ExportFailures Class
Autodesk.Revit.DB Namespace